Arch-genue/esp8266-cmake-template/src/constants.h
#pragma once

#include <ESP8266WebServer.h>

#define GL_VERSION 1.0

// ============= НАСТРОЙКИ =============
#define USE_SECRET_COMMANDS                                 // удалите эту строку, если вам не нужна возможность смены режимов работы ESP_MODE и обнуления настроек из приложения (действительно, всё ненужное лучше выключать)
                                                            // список секретных команд тут: https://community.alexgyver.ru/goto/post?id=55780
//#define USE_BLYNK  ("сюда_вставить_токен_из_приложения")  // раскомментируйте эту строку, если вы используете приложение Blynk (для iOS и Android) https://community.alexgyver.ru/goto/post?id=53535
                                                            // токен берут в приложении в "настройки -> DEVICES -> MY DEVICES -> AUTH TOKEN"
#define USE_IOS_APP                                         // раскомментируйте эту строку, если вы используете приложение для iOS "Arduino Lamp" (удалено из Апстора, исходники на форуме)
                                                            // или "Цветолампа" https://apps.apple.com/ru/app/цветолампа/id1530664658
//#define USE_SHUFFLE_FAVORITES                             // раскомментируйте эту строку, если вам нужно, чтобы режим Цикл показал каждый эффект по 1 разу перед перемешиванием (иначе просто случайный эффект),
                                                            // а также если у вас выбрано меньше десятка эффектов. кстати, если выбрано менее 2 эффектов, то демонстрироваться будут все эффекты по порядку без перемешивания
//#define DONT_TURN_ON_AFTER_SHUTDOWN                         // удалите эту строку, если нужно, чтобы лампа возобновляла демонстрацию эффекта/эффектов после обесточивания
//#define AUTOMATIC_OFF_TIME    (5 * 60UL * 60UL * 1000UL)  // раскомментируйте эту строку, если нужно, чтобы лампа выключалась сама после 5 часов непрерывной работы (вдруг кто забыл перед отъездом выключить её). в приложении время будет отображаться некорректно!
#define USE_DEFAULT_SETTINGS_RESET                          // закомментируйте или удалите эту строку, если не нужно, чтобы при загрузке списка эффектов из лампы в приложение настройки эффектов сбрасывались на значения по умолчанию

// --- ESP -----------------------------
#define ESP_MODE              (1U)                          // (0U) - лампа работает как WiFi точка доступа всегда (работа без роутера),
                                                            // (1U) - лампа - клиент WiFi (работа через роутер). сперва тоже появится точка доступа, чтобы можно было настроить подключение к роутеру.
                                                            // данный выбор режима влияет только на первую загрузку прошивки. потом он сохраняется в настройках и может изменяться в процессе эксплуатации лампы
                                                            // подробнее можно почитать по ссылке: https://community.alexgyver.ru/goto/post?id=33674
                                                            // для ESP_MODE 0U -> обратите внимание, что ip-адрес лампы в приложении придётся писать вручную. поиск не сработает, а в строках приложения будет отображаться пример написания, а не готовый адрес и порт
#define ESP_CONF_TIMEOUT      (300U)                        // время в секундах, которое лампа будет ждать от вас настроек подключения к роутеру,
                                                            // после его истечения ESP-контроллер перезагружается в режим #define ESP_MODE (0U)
#define ESP_USE_BUTTON                                      // если строка не закомментирована, должна быть подключена кнопка (иначе лампа может регистрировать "фантомные" нажатия и некорректно устанавливать яркость)
                                                            // если у вас не сенсорная, а обычная кнопка, ищите на первой вкладке строчку GButton touch(BTN_PIN, LOW_PULL, NORM_OPEN); 
//#define GENERAL_DEBUG                                     // если строка не закомментирована, будут выводиться отладочные сообщения

#define LED_PIN               14//(2U)                          // пин ленты                (D4) - встроенный светодиод контроллера тоже на D4, поэтому лучше паять на D3 = #define LED_PIN (0U)
#define BTN_PIN               4//(4U)                          // пин кнопки               (D2)
//#define MOSFET_PIN            (5U)                        // пин MOSFET транзистора   (D1) - может быть использован для управления питанием матрицы/ленты (если раскомментировать строку)
//#define ALARM_PIN             (16U)                       // пин состояния будильника (D0) - может быть использован для управления каким-либо внешним устройством на время работы будильника (если раскомментировать)
//#define MOSFET_LEVEL          (HIGH)                      // логический уровень, в который будет установлен пин MOSFET_PIN, когда матрица включена - HIGH или LOW (если раскомментировать)
//#define ALARM_LEVEL           (HIGH)                      // логический уровень, в который будет установлен пин ALARM_PIN, когда "рассвет"/будильник включен (если раскомментировать)

// --- ESP (WiFi клиент) ---------------
#define SEND_LAMP_NAME_TO_APP                               // раскомментируйте эту строку, если нужно дать имя лампе в приложении (на случай, когда у вас в домашней сети несколько ламп)
                                                            // имя будет точно такое же, как имя у точки доступа (смотрите ниже строчку #define AP_NAME)
const uint8_t STA_STATIC_IP[] = {};                         // фиксация IP адреса лампы в локальной сети: {} - IP адрес определяется роутером; {192, 168, 1, 66} - IP адрес задан явно (если DHCP на роутере не решит иначе); должен быть из того же диапазона адресов, что разадёт роутер
                                                            // поговаривают, что ничего не будет работать, если прописать здесь ip-адрес. и что нужно настраивать постоянный адрес для лампы в настройках роутера
                                                            // SSID WiFi сети и пароль будут запрошены WiFi Manager'ом в режиме WiFi точки доступа, нет способа указать их в прошивке
// --- AP (WiFi точка доступа) ---
#define AP_NAME               ("VladLamp")                 // имя WiFi точки доступа, используется как при запросе SSID и пароля WiFi сети роутера, так и при работе в режиме ESP_MODE = 0
#define AP_PASS               ("16042004")                  // пароль WiFi точки доступа
const uint8_t AP_STATIC_IP[] = {192, 168, 4, 1};            // статический IP точки доступа (лучше не менять!)

