Arch-genue/esp8266-cmake-template/src/constants.h
// если у вас не обычная матрица, а сборка из ленты или гирлянда, и возникают непонятной природы артефакты в рисунке эффекта, попробуйте менять следующие три строчки
//#define FASTLED_ALLOW_INTERRUPTS      (1)                 // default: 1; // Use this to force FastLED to allow interrupts in the clockless chipsets (or to force it to disallow), overriding the default on platforms that support this. Set the value to 1 to allow interrupts or 0 to disallow them.
#define FASTLED_INTERRUPT_RETRY_COUNT   (0)                 // default: 2; // Use this to determine how many times FastLED will attempt to re-transmit a frame if interrupted for too long by interrupts
#define FASTLED_ESP8266_RAW_PIN_ORDER                       // FASTLED_ESP8266_RAW_PIN_ORDER, FASTLED_ESP8266_D1_PIN_ORDER or FASTLED_ESP8266_NODEMCU_PIN_ORDER


#define NUM_LEDS              (uint16_t)(WIDTH * HEIGHT)
#define SEGMENTS              (1U)                          // диодов в одном "пикселе" (для создания матрицы из кусков ленты). вряд ли эффекты будут корректно работать, если изменить этот параметр

#define BRIGHTNESS            (150U)                         // стандартная маскимальная яркость (0-255) вряд ли параметр вообще нужен

#if defined (ESP_USE_BUTTON)
#define BUTTON_STEP_TIMEOUT   (100U)                        // каждые BUTTON_STEP_TIMEOUT мс будет генерироваться событие удержания кнопки (для регулировки яркости)
#define BUTTON_CLICK_TIMEOUT  (500U)                        // максимальное время между нажатиями кнопки в мс, до достижения которого считается серия последовательных нажатий
#endif

extern uint8_t espMode; // ESP_MODE может быть сохранён в энергонезависимую память и изменён в процессе работы лампы без необходимости её перепрошивки

#define ESP_RESET_ON_START    (false)                       // true - если при старте нажата кнопка (или кнопки нет!), сохранённые настройки будут сброшены; false - не будут
#define ESP_HTTP_PORT         (80U)                         // номер порта, который будет использоваться во время первой утановки имени WiFi сети (и пароля), к которой потом будет подключаться лампа в режиме WiFi клиента (лучше не менять)
#define ESP_UDP_PORT          (8888U)                       // номер порта, который будет "слушать" UDP сервер во время работы лампы как в режиме WiFi точки доступа, так и в режиме WiFi клиента (лучше не менять)
#define ESP_CONN_TIMEOUT      (5U)                          // время в секундах (ДОЛЖНО БЫТЬ МЕНЬШЕ 8, иначе сработает WDT), которое ESP будет пытаться подключиться к WiFi сети, после его истечения автоматически развернёт WiFi точку доступа

#define WIFIMAN_DEBUG         (false)                       // вывод отладочных сообщений при подключении к WiFi сети: true - выводятся, false - не выводятся; настройка не зависит от GENERAL_DEBUG
#define OTA                                                 // если строка не закомментирована, модуль будет ждать два последовательных запроса пользователя на прошивку по воздуху (два четрёхкратных нажатия на кнопку)
#ifdef OTA
#define ESP_OTA_PORT          (1604U)                       // номер порта, который будет "прослушиваться" в ожидании команды прошивки по воздуху
#endif

#define LOCAL_WEEK_NUM        (week_t::Last)                // для стран, где нет перехода на зимнее/летнее время это технический параметр, не нужно его изменять
#define LOCAL_WEEKDAY         (dow_t::Sun)                  // для стран, где нет перехода на зимнее/летнее время это технический параметр, не нужно его изменять
#define LOCAL_MONTH           (month_t::Mar)                // для стран, где нет перехода на зимнее/летнее время это технический параметр, не нужно его изменять
#define LOCAL_HOUR            (1U)                          // для стран, где нет перехода на зимнее/летнее время это технический параметр, не нужно его изменять
#define LOCAL_TIMEZONE_NAME   ("")                       //* было "MSK" обозначение локального часового пояса; до 5 символов; может быть использовано, если понадобится его вывести после вывода времени


// --- РАССВЕТ -------------------------
#define DAWN_BRIGHT           (255U)                        // максимальная яркость рассвета (0-255)
#define DAWN_TIMEOUT          (3U)                          // сколько рассвет светит после времени будильника, минут


//#define MAX_UDP_BUFFER_SIZE (UDP_TX_PACKET_MAX_SIZE + 1)
// максимальный размер буффера UDP сервера 
// 255 - это максимальное значение, при котором работа с Избранным не будет глючить
// для исходящих сообщений в приложение данное ограничение можно обойти (см. как реализована отправка "LIST"),
// а для входящего списка избранного - хз. пришлось увеличить до максимально возможножного значения. 
// дальше придётся переделывать типы (размеры) переменных в функциях FavoritesManager.h
#define MAX_UDP_BUFFER_SIZE   (255U)                        // максимальный размер буффера UDP сервера


#define LOG Serial


// -------------- ВНУТР. КОНСТАНТЫ ---------------
#define GL_ADC_NONE 1
#define GL_ADC_MIC 2
#define GL_TYPE_STRIP 1
#define GL_TYPE_ZIG 2
#define GL_TYPE_PARAL 3
#define GL_ADV_NONE 1
#define GL_ADV_VOL 2
#define GL_ADV_LOW 3
#define GL_ADV_HIGH 4
#define GL_ADV_CLOCK 5
#define GL_REACT_BRI 1
#define GL_REACT_SCL 2
#define GL_REACT_LEN 3
#define GL_SLAVE 0
#define GL_MASTER 1

#define CFG_SIZE 12

struct Config {
    byte bright = 100;      // яркость
    byte adcMode = 2;       // режим ацп (1 выкл, 2 муз)
    byte minBright = 0;     // мин яркость
    byte maxBright = 255;   // макс яркость
    byte rotation = 0;      // смена режимов: 0 ручная, 1 авто
    byte rotRnd = 0;        // тип автосмены: 0 в порядке, 1 рандом
    byte rotPeriod = 1;     // период смены (1,5..)
    byte deviceType = 2;    // 1 лента, 2 зигзаг, 3 параллел
    byte maxCur = 5;        // макс ток (мА/100)
    byte workFrom = 0;      // часы работы (0,1.. 23)
    byte workTo = 0;        // часы работы (0,1.. 23)
    byte matrix = 1;        // тип матрицы 1.. 8

    int16_t length = 16;    // длина ленты
    int16_t width = 16;     // ширина матрицы

    byte GMT = 16;          // часовой пояс +13
    uint32_t cityID = 1;    // city ID
    bool mqtt = 0;          // mqtt
    char mqttID[32];        //
    char mqttHost[32];      //
    int mqttPort = 0;       //
    char mqttLogin[16];     //
    char mqttPass[16];      //

    byte state = 1;         // состояние 0 выкл, 1 вкл
    byte group = 1;         // группа девайса (1-10)
    byte role = 0;          // 0 slave, 1 master
    byte WiFimode = 0;      // 0 AP, 1 local
    byte presetAmount = 1;  // количество режимов
    byte manualOff = 0;     // выключали вручную?
    int8_t curPreset = 0;   // текущий режим
    int16_t minLight = 0;   // мин освещённость
    int16_t maxLight = 1023;// макс освещённость
    char ssid[32];          // логин wifi
    char pass[32];          // пароль wifi
    byte version = GL_VERSION;
    byte update = 0;
};

#define PRES_SIZE 13
#define MAX_PRESETS 40
struct Preset {
    byte effect = 1;        // тип эффекта (1,2...) ВЫЧЕСТЬ 1
    byte fadeBright = 1;    // флаг на свою яркость (0/1)
    byte bright = 100;      // своя яркость (0.. 255)
    byte advMode = 1;       // дополнительно (1,2...) ВЫЧЕСТЬ 1
    byte soundReact = 1;    // реакция на звук (1,2...) ВЫЧЕСТЬ 1
    byte min = 20;           // мин сигнал светомузыки (0.. 255)
    byte max = 255;           // макс сигнал светомузыки (0.. 255)
    byte speed = 200;       // скорость (0.. 255)
    byte palette = 2;       // палитра (1,2...) ВЫЧЕСТЬ 1
    byte scale = 100;       // масштаб (0.. 255)
    byte fromCenter = 1;    // эффект из центра (0/1)
    byte color = 30
    ;         // цвет (0.. 255)
    byte fromPal = 0;       // из палитры (0/1)
};

