Arch-genue/esp8266-cmake-template/src/constants.h
#define DAWN_SIZE 24
struct Dawn {
    byte state[7] = {0, 0, 0, 0, 0, 0, 0};  // (1/0)
    byte hour[7] = {0, 0, 0, 0, 0, 0, 0};   // (0.. 59)
    byte minute[7] = {0, 0, 0, 0, 0, 0, 0}; // (0.. 59)
    byte bright = 100;      // (0.. 255)
    byte time = 1;          // (5,10,15,20..)
    byte post = 1;          // (5,10,15,20..)
};

#define EE_TOUT 30000       // таймаут сохранения епром после изменения, мс
#define DEBUG_SERIAL_LAMP   // закомментируй чтобы выключить отладку (скорость 115200)
#define EE_KEY 56 

#define PAL_SIZE 49
struct Palette {
    byte size = 1;
    byte strip[16 * 3];
};

extern Config cfg;
extern Preset preset[MAX_PRESETS];
extern Dawn dawn;
extern Palette pal;

#include "timers.h"

extern Time now;

extern uint32_t udpTmr;
extern uint32_t gotADCtmr;
extern bool loading;

extern int udpLength;
extern byte udpScale;
extern byte udpBright;

#define CUR_PRES preset[cfg.curPreset]

#define USE_ADC 1
#define USE_CLAP 0          // два хлопка в ладоши вкл выкл лампу
#define MIC_VCC 12          // питание микрофона GPIO12 (D6 на wemos/node)

#include "volanalyzer.h"

extern VolAnalyzer vol;
extern VolAnalyzer low;
extern VolAnalyzer high;

byte scaleFF(byte x, byte b);

int mapFF(byte x, byte min, byte max);

// // ------------------- МАКРО --------------------
#ifdef DEBUG_SERIAL_LAMP
	#define DEBUGLN(x) Serial.println(x)
	#define DEBUG(x) Serial.print(x)
#else
	#define DEBUGLN(x)
	#define DEBUG(x)
#endif

#define FOR_i(x,y)  for (int i = (x); i < (y); i++)
#define FOR_j(x,y)  for (int j = (x); j < (y); j++)
#define FOR_k(x,y)  for (int k = (x); k < (y); k++)

extern byte btnClicks, brTicks;

extern timerMillis EEtmr;
extern timerMillis turnoffTmr;
extern timerMillis connTmr;
extern timerMillis dawnTmr;
extern timerMillis holdPresTmr;
extern timerMillis blinkTmr;

extern timerMillis effTmr;
extern timerMillis onlineTmr;
extern timerMillis postDawn;
extern TimeRandom trnd;

extern bool gotNTP;
extern bool gotTime;

#include "utility.h"

void presetRotation(bool force);
void changePreset(int dir);
void setPreset(byte pres);
void controlHandler(bool state);
void fade(bool state);
void setPower(bool state);
void fadeDown(uint32_t time);
